In [1]:
pip install pandas

Requirement already satisfied: pandas in d:\anaconda\lib\site-packages (1.4.4)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: pytz>=2020.1 in d:\anaconda\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: numpy>=1.18.5 in d:\anaconda\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: python-dateutil>=2.8.1 in d:\anaconda\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in d:\anaconda\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

WARNING: Ignoring invalid distribution -umpy (d:\anaconda\lib\site-packages)
WARNING: Ignoring invalid distribution -umpy (d:\anaconda\lib\site-packages)
WARNING: Ignoring invalid distribution -umpy (d:\anaconda\lib\site-packages)
WARNING: Ignoring invalid distribution -umpy (d:\anaconda\lib\site-packages)
WARNING: Ignoring invalid distribution -umpy (d:\anaconda\lib\site-packages)
WARNING: Ignoring invalid distribution -umpy (d:\anaconda\lib\site-packages)

In [2]:
import pandas as pd

In [4]:
import numpy as np

# Series

In [5]:
s=pd.Series(np.random.rand(5))
s

0    0.837510
1    0.122054
2    0.730755
3    0.015821
4    0.711726
dtype: float64

In [6]:
#indexing
s[3]

0.015821093521035223

In [7]:
s[4]

0.7117261410079313

In [8]:
#Slicing
s[2:]

2    0.730755
3    0.015821
4    0.711726
dtype: float64

In [9]:
#update the value
s[0]=100

In [10]:
s

0    100.000000
1      0.122054
2      0.730755
3      0.015821
4      0.711726
dtype: float64

In [11]:
s.index=['a','b','c','d','e']
s

a    100.000000
b      0.122054
c      0.730755
d      0.015821
e      0.711726
dtype: float64

In [14]:
s.index=['*','*','*','*','*']
s

*    100.000000
*      0.122054
*      0.730755
*      0.015821
*      0.711726
dtype: float64

In [15]:
s=pd.Series(np.random.rand(5),index=['a','b','c','d','e'])
s

a    0.691564
b    0.348830
c    0.098830
d    0.411870
e    0.607831
dtype: float64

In [16]:
s.argmax()

0

In [18]:
s.argmin()

2

In [19]:
#Mean
s.mean()

0.43178513150436554

In [20]:
#median
s.median()

0.41186999618824227

In [21]:
s.max()

0.6915637969228629

In [22]:
s.min()

0.098830114234007

In [23]:
s.dtype

dtype('float64')

In [24]:
x=pd.Series([1,2,3,4,5,6])
x

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [25]:
x.dtype

dtype('int64')

# DataFrame

In [26]:
s1=pd.Series(np.random.rand(5))
s2=pd.Series(np.random.rand(5))

In [27]:
print(s1)
print(s2)

0    0.741278
1    0.533136
2    0.329076
3    0.785716
4    0.102419
dtype: float64
0    0.696954
1    0.854227
2    0.977019
3    0.982731
4    0.358006
dtype: float64

In [28]:
# Creating DataFrame using Series
a=pd.DataFrame([s1,s2])
a

          0         1         2         3         4
0  0.741278  0.533136  0.329076  0.785716  0.102419
1  0.696954  0.854227  0.977019  0.982731  0.358006

In [29]:
# Creating DataFrame with Dictionary
d={'age':[22,23,24],'salary':[1000,1020,1040]}
d

{'age': [22, 23, 24], 'salary': [1000, 1020, 1040]}

In [30]:
type(d)

dict

In [31]:
#Converting dictionary to DataFrame
data=pd.DataFrame(d)
data

   age  salary
0   22    1000
1   23    1020
2   24    1040

In [32]:
data['gender']=['Male','Female','Male']
data

   age  salary  gender
0   22    1000    Male
1   23    1020  Female
2   24    1040    Male

In [33]:
# iloc - Accessing with Indexing 
#loc- Accessing with location

In [34]:
#iloc
data.iloc[0:2,1:]

   salary  gender
0    1000    Male
1    1020  Female

In [35]:
data.iloc[0:2,0:2]

   age  salary
0   22    1000
1   23    1020

In [36]:
data.iloc[1:,1:]

   salary  gender
1    1020  Female
2    1040    Male

In [37]:
data.iloc[1:,0:2]

   age  salary
1   23    1020
2   24    1040

In [40]:
data.iloc[1:2,0:]

   age  salary  gender
1   23    1020  Female

In [41]:
data.iloc[1:,0:]

   age  salary  gender
1   23    1020  Female
2   24    1040    Male

In [42]:
#loc
data.loc[:,['age','gender']]

   age  gender
0   22    Male
1   23  Female
2   24    Male

In [43]:
data['salary']

0    1000
1    1020
2    1040
Name: salary, dtype: int64

In [44]:
data.loc[:,['salary']]

   salary
0    1000
1    1020
2    1040

In [45]:
data.shape

(3, 3)

In [46]:
data.columns

Index(['age', 'salary', 'gender'], dtype='object')

In [47]:
data.dtypes

age        int64
salary     int64
gender    object
dtype: object

In [48]:
data.isnull()

     age  salary  gender
0  False   False   False
1  False   False   False
2  False   False   False

In [49]:
data.isnull().sum()

age       0
salary    0
gender    0
dtype: int64

In [50]:
#drop a column
data.drop(columns=['gender'],axis=1)
#axis=1---Columns
#axis=0---Rows

   age  salary
0   22    1000
1   23    1020
2   24    1040

In [51]:
data.duplicated()

0    False
1    False
2    False
dtype: bool

In [52]:
data=pd.read_csv('mtcars.csv')
data

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2
5,Valiant,18.1,6,225.0,105,2.76,3.460,20.22,1,0,3,1
6,Duster 360,14.3,8,360.0,245,3.21,3.570,15.84,0,0,3,4
7,Merc 240D,24.4,4,146.7,62,3.69,3.190,20.00,1,0,4,2
8,Merc 230,22.8,4,140.8,95,3.92,3.150,22.90,1,0,4,2
9,Merc 280,19.2,6,167.6,123,3.92,3.440,18.30,1,0,4,4
10,Merc 280C,17.8,6,167.6,123,3.92,3.440,18.90,1,0,4,4
11,Merc 450SE,16.4,8,275.8,180,3.07,4.070,17.40,0,0,3,3
12,Merc 450SL,17.3,8,275.8,180,3.07,3.730,17.60,0,0,3,3
13,Merc 450SLC,15.2,8,275.8,180,3.07,3.780,18.00,0,0,3,3
14,Cadillac Fleetwood,10.4,8,472.0,205,2.93,5.250,17.98,0,0,3,4
15,Lincoln Continental,10.4,8,460.0,215,3.00,5.424,17.82,0,0,3,4
16,Chrysler Imperial,14.7,8,440.0,230,3.23,5.345,17.42,0,0,3,4
17,Fiat 128,32.4,4,78.7,66,4.08,2.200,19.47,1,1,4,1
18,Honda Civic,30.4,4,75.7,52,4.93,1.615,18.52,1,1,4,2
19,Toyota Corolla,33.9,4,71.1,65,4.22,1.835,19.90,1,1,4,1
20,Toyota Corona,21.5,4,120.1,97,3.70,2.465,20.01,1,0,3,1
21,Dodge Challenger,15.5,8,318.0,150,2.76,3.520,16.87,0,0,3,2
22,AMC Javelin,15.2,8,304.0,150,3.15,3.435,17.30,0,0,3,2
23,Camaro Z28,13.3,8,350.0,245,3.73,3.840,15.41,0,0,3,4
24,Pontiac Firebird,19.2,8,400.0,175,3.08,3.845,17.05,0,0,3,2
25,Fiat X1-9,27.3,4,79.0,66,4.08,1.935,18.90,1,1,4,1
26,Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.70,0,1,5,2
27,Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.90,1,1,5,2
28,Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.50,0,1,5,4
29,Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.50,0,1,5,6
30,Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.60,0,1,5,8
31,Volvo 142E,21.4,4,121.0,109,4.11,2.780,18.60,1,1,4,2

In [53]:
data.head()

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [54]:
data.tail()

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
27,Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.9,1,1,5,2
28,Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.5,0,1,5,4
29,Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.5,0,1,5,6
30,Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.6,0,1,5,8
31,Volvo 142E,21.4,4,121.0,109,4.11,2.780,18.6,1,1,4,2

In [55]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 12 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   model   32 non-null     object
 1   mpg     32 non-null     float64
 2   cyl     32 non-null     int64
 3   disp    32 non-null     float64
 4   hp      32 non-null     int64
 5   drat    32 non-null     float64
 6   wt      32 non-null     float64
 7   qsec    32 non-null     float64
 8   vs      32 non-null     int64
 9   am      32 non-null     int64
 10  gear    32 non-null     int64
 11  carb    32 non-null     int64
dtypes: float64(5), int64(6), object(1)
memory usage: 3.1+ KB

In [56]:
data.isnull().sum()

model    0
mpg      0
cyl      0
disp     0
hp       0
drat     0
wt       0
qsec     0
vs       0
am       0
gear     0
carb     0
dtype: int64

In [57]:
data.describe()

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
count,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.0000
mean,20.090625,6.187500,230.721875,146.687500,3.596563,3.217250,17.848750,0.437500,0.406250,3.687500,2.8125
std,6.026948,1.785922,123.938694,68.562868,0.534679,0.978457,1.786943,0.504016,0.498991,0.737804,1.6152
min,10.400000,4.000000,71.100000,52.000000,2.760000,1.513000,14.500000,0.000000,0.000000,3.000000,1.0000
25%,15.425000,4.000000,120.825000,96.500000,3.080000,2.581250,16.892500,0.000000,0.000000,3.000000,2.0000
50%,19.200000,6.000000,196.300000,123.000000,3.695000,3.325000,17.710000,0.000000,0.000000,4.000000,2.0000
75%,22.800000,8.000000,326.000000,180.000000,3.920000,3.610000,18.900000,1.000000,1.000000,4.000000,4.0000
max,33.900000,8.000000,472.000000,335.000000,4.930000,5.424000,22.900000,1.000000,1.000000,5.000000,8.0000